- apply
- datetimes
- group 
- agg

In [14]:
import pandas as pd

df = pd.read_csv("./data/french-ambs.csv")
df.head()

   id                name    place  year    lat   long      lat_long
0   0  Richer, Christophe  Denmark  1543  55.68  12.57  55.68, 12.57
1   1  Richer, Christophe  Denmark  1541  55.68  12.57  55.68, 12.57
2   2  Danzay, Charles de  Denmark  1561  55.68  12.57  55.68, 12.57
3   3  Danzay, Charles de  Denmark  1563  55.68  12.57  55.68, 12.57
4   4  Danzay, Charles de  Denmark  1582  55.68  12.57  55.68, 12.57

In [15]:
from random import choice

# import random
# random.choice
df["date_start"] = f"{df["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
df.head()

,id,name,place,year,lat,long,lat_long,date_start
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",0 1543\n1 1541\n2 1561\n3 ...
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",0 1543\n1 1541\n2 1561\n3 ...
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",0 1543\n1 1541\n2 1561\n3 ...
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",0 1543\n1 1541\n2 1561\n3 ...
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",0 1543\n1 1541\n2 1561\n3 ...

In [16]:
df = df.drop(columns=["date_start", "lat_long"])
df = df[["name", "place", "year"]]
df.head()

                 name    place  year
0  Richer, Christophe  Denmark  1543
1  Richer, Christophe  Denmark  1541
2  Danzay, Charles de  Denmark  1561
3  Danzay, Charles de  Denmark  1563
4  Danzay, Charles de  Denmark  1582

In [17]:
# apply on data series
def my_function(x):
    return x


df["date_start"] = df["year"].apply(lambda x: f"{x}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}")
df.head()

                 name    place  year  date_start
0  Richer, Christophe  Denmark  1543  1543-08-28
1  Richer, Christophe  Denmark  1541  1541-03-09
2  Danzay, Charles de  Denmark  1561  1561-12-18
3  Danzay, Charles de  Denmark  1563  1563-08-04
4  Danzay, Charles de  Denmark  1582  1582-12-17

In [18]:
import numpy as np

def get_date_start(row):
    rows = df.loc[
        (df["place"] == row["place"]) &
        (df["name"] == row["name"]) &
        (df["year"] ==  row["year"] - 1)
    ]
    if len(rows) > 0: # len(rows) > 0:
        return np.nan
    
    date_string = f"{row["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
    return date_string
    
df["date_start"] = df.apply(get_date_start, axis=1)
df.head()

                 name    place  year  date_start
0  Richer, Christophe  Denmark  1543         NaN
1  Richer, Christophe  Denmark  1541  1541-04-04
2  Danzay, Charles de  Denmark  1561         NaN
3  Danzay, Charles de  Denmark  1563         NaN
4  Danzay, Charles de  Denmark  1582         NaN

In [19]:
def get_date_end(row):
    rows = df.loc[
        (df["place"] == row["place"]) &
        (df["name"] == row["name"]) &
        (df["year"] ==  row["year"] + 1)
    ]
    if len(rows) > 0: # len(rows) > 0:
        return np.nan
    
    date_string = f"{row["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
    return date_string
    
df["date_end"] = df.apply(get_date_end, axis=1)
df.head()

                 name    place  year  date_start date_end
0  Richer, Christophe  Denmark  1543         NaN      NaN
1  Richer, Christophe  Denmark  1541  1541-04-04      NaN
2  Danzay, Charles de  Denmark  1561         NaN      NaN
3  Danzay, Charles de  Denmark  1563         NaN      NaN
4  Danzay, Charles de  Denmark  1582         NaN      NaN

In [20]:
# bfill() , ffill() but first sort values appropriately
df = df.sort_values(["place", "name", "year"], ascending=True)
df

                    name    place  year  date_start    date_end
422   Danzay, Charles de  Denmark  1557  1557-11-25         NaN
638   Danzay, Charles de  Denmark  1558         NaN         NaN
704   Danzay, Charles de  Denmark  1559         NaN         NaN
421   Danzay, Charles de  Denmark  1560         NaN         NaN
2     Danzay, Charles de  Denmark  1561         NaN         NaN
..                   ...      ...   ...         ...         ...
112     Séguier, Antoine   Venice  1599         NaN         NaN
531     Séguier, Antoine   Venice  1600         NaN  1600-10-09
353  d'Armagnac, Georges   Venice  1536  1536-05-15         NaN
756  d'Armagnac, Georges   Venice  1537         NaN         NaN
757  d'Armagnac, Georges   Venice  1538         NaN  1538-03-03

[869 rows x 5 columns]

In [21]:
df["date_start"] = df["date_start"].ffill()
df["date_end"] = df["date_end"].bfill()
df

                    name    place  year  date_start    date_end
422   Danzay, Charles de  Denmark  1557  1557-11-25  1589-10-09
638   Danzay, Charles de  Denmark  1558  1557-11-25  1589-10-09
704   Danzay, Charles de  Denmark  1559  1557-11-25  1589-10-09
421   Danzay, Charles de  Denmark  1560  1557-11-25  1589-10-09
2     Danzay, Charles de  Denmark  1561  1557-11-25  1589-10-09
..                   ...      ...   ...         ...         ...
112     Séguier, Antoine   Venice  1599  1598-10-16  1600-10-09
531     Séguier, Antoine   Venice  1600  1598-10-16  1600-10-09
353  d'Armagnac, Georges   Venice  1536  1536-05-15  1538-03-03
756  d'Armagnac, Georges   Venice  1537  1536-05-15  1538-03-03
757  d'Armagnac, Georges   Venice  1538  1536-05-15  1538-03-03

[869 rows x 5 columns]

In [22]:
from datetime import datetime
fmt = "%Y-%m-%d"

df["date_end"] = df["date_end"].apply(lambda x: datetime.strptime(x,fmt))
df["date_start"] = df["date_start"].apply(lambda x: datetime.strptime(x,fmt))
df

                    name    place  year date_start   date_end
422   Danzay, Charles de  Denmark  1557 1557-11-25 1589-10-09
638   Danzay, Charles de  Denmark  1558 1557-11-25 1589-10-09
704   Danzay, Charles de  Denmark  1559 1557-11-25 1589-10-09
421   Danzay, Charles de  Denmark  1560 1557-11-25 1589-10-09
2     Danzay, Charles de  Denmark  1561 1557-11-25 1589-10-09
..                   ...      ...   ...        ...        ...
112     Séguier, Antoine   Venice  1599 1598-10-16 1600-10-09
531     Séguier, Antoine   Venice  1600 1598-10-16 1600-10-09
353  d'Armagnac, Georges   Venice  1536 1536-05-15 1538-03-03
756  d'Armagnac, Georges   Venice  1537 1536-05-15 1538-03-03
757  d'Armagnac, Georges   Venice  1538 1536-05-15 1538-03-03

[869 rows x 5 columns]

In [24]:
df["date_end"].apply(lambda x: x.date)

422    <bound method Timestamp.date of Timestamp('158...
638    <bound method Timestamp.date of Timestamp('158...
704    <bound method Timestamp.date of Timestamp('158...
421    <bound method Timestamp.date of Timestamp('158...
2      <bound method Timestamp.date of Timestamp('158...
                             ...
112    <bound method Timestamp.date of Timestamp('160...
531    <bound method Timestamp.date of Timestamp('160...
353    <bound method Timestamp.date of Timestamp('153...
756    <bound method Timestamp.date of Timestamp('153...
757    <bound method Timestamp.date of Timestamp('153...
Name: date_end, Length: 869, dtype: object

In [25]:
placesdf = df.groupby(["place"]).count()
placesdf

                   name  year  date_start  date_end
place
Denmark              40    40          40        40
England              93    93          93        93
Ferrara               3     3           3         3
Geneva                2     2           2         2
Grisons              77    77          77        77
Holy Roman Empire    81    81          81        81
Netherlands          45    45          45        45
Ottoman Empire       89    89          89        89
Poland                7     7           7         7
Portugal             56    56          56        56
Rome                 82    82          82        82
Savoy                 4     4           4         4
Saxony                3     3           3         3
Scotland             22    22          22        22
Spain                35    35          35        35
Swiss Cantons       131   131         131       131
Tuscany               3     3           3         3
Venice               96    96          96        96

In [28]:
placesdf = df.groupby(["place"]).agg(
    {
        "name": "count",
        "year": "min",
        "year": "max",
    }
).reset_index()
placesdf

                place  name  year
0             Denmark    40  1589
1             England    93  1600
2             Ferrara     3  1554
3              Geneva     2  1560
4             Grisons    77  1588
5   Holy Roman Empire    81  1600
6         Netherlands    45  1600
7      Ottoman Empire    89  1600
8              Poland     7  1574
9            Portugal    56  1578
10               Rome    82  1589
11              Savoy     4  1574
12             Saxony     3  1572
13           Scotland    22  1588
14              Spain    35  1589
15      Swiss Cantons   131  1600
16            Tuscany     3  1529
17             Venice    96  1600

In [30]:
placesdf = df.groupby("place").agg(
    num=("year", "count"),
    min_year=("year", "min"),
    max_year=("year", "max"),
    ambs=("name", "unique"),
    num_ambs=("name", "nunique")
).sort_values(["num"]).reset_index()
placesdf

,place,num,min_year,max_year,ambs,num_ambs
0,Geneva,2,1559,1560,"[Boistaillé, Jean Hurault de]",1
1,Ferrara,3,1535,1554,"[Du Gabre, Dominique, Langeac, Jean de]",2
2,Saxony,3,1570,1572,"[Schomberg, Gaspard de]",1
3,Tuscany,3,1527,1529,"[Dodieu, Claude]",1
4,Savoy,4,1528,1574,"[Des Barres, Louis, Henri d'Angouleme, Sr. de ...",3
5,Poland,7,1572,1574,"[Fayes, Jacques, sr d'Espesses, Lansac, Guy de...",5
6,Scotland,22,1548,1588,"[Clutin, Henri, Courcelles, Baron de, Du Croc,...",4
7,Spain,35,1559,1589,"[Fourquevaux, Raymond de Beccarie de Pavie, Ba...",5
8,Denmark,40,1541,1589,"[Danzay, Charles de, Richer, Christophe]",2
9,Netherlands,45,1529,1600,"[Blatier, Claude, Bochetel, Jacques, Choary, P...",12
10,Portugal,56,1522,1578,"[De Caix, Honoré, De Seurre, Miguel, Nicot, Je...",5
11,Grisons,77,1525,1588,"[Bellièvre, Pomponne de, Cambray, Jean-Jacques...",13
12,Holy Roman Empire,81,1519,1600,"[Ancel, Guillaume, Bochetel, Bernardin, Calvim...",15
13,Rome,82,1513,1589,"[Adhemar, Louis, Babou, Philibert, Carmain, Pa...",24
14,Ottoman Empire,89,1535,1600,"[Berthier, Sébastien, Cambray, Jacques de, Cot...",20
15,England,93,1516,1600,"[Bapaume, Robert de, Bochetel, Jacques, Castel...",26
16,Venice,96,1516,1600,"[Boistaillé, Jean Hurault de, Canossa, Louis d...",20
17,Swiss Cantons,131,1522,1600,"[Bellièvre, Jean de, sr. de Hautefort, Bellièv...",27

In [32]:
place_names = df.groupby(["place", "name"]).agg(
    num=("year", "count"),
    min_year=("year", "min"),
    max_year=("year", "max"),
    ambs=("name", "unique"),
    num_ambs=("name", "nunique")
).reset_index().sort_values(["num"], ascending=False)
place_names

,place,name,num,min_year,max_year,ambs,num_ambs
0,Denmark,"Danzay, Charles de",33,1557,1589,"[Danzay, Charles de]",1
96,Portugal,"De Caix, Honoré",33,1522,1558,"[De Caix, Honoré]",1
147,Swiss Cantons,"Daugerant, Louis",29,1522,1549,"[Daugerant, Louis]",1
44,Holy Roman Empire,"Ancel, Guillaume",25,1576,1600,"[Ancel, Guillaume]",1
98,Portugal,"Nicot, Jean",16,1560,1575,"[Nicot, Jean]",1
...,...,...,...,...,...,...,...
127,Savoy,Sr. de Sauves,1,1574,1574,[Sr. de Sauves],1
164,Swiss Cantons,"de Crascier, Balthazar",1,1564,1564,"[de Crascier, Balthazar]",1
159,Swiss Cantons,"Tugginer,Guillaume",1,1563,1563,"[Tugginer,Guillaume]",1
157,Swiss Cantons,"Mendoza, Diego de",1,1562,1562,"[Mendoza, Diego de]",1
177,Venice,Jean de Morvillier,1,1546,1546,[Jean de Morvillier],1